app/controllers/agendamento_de_visitas_controller.rb

SELECT "agendamento_de_visitas".* FROM "agendamento_de_visitas"
---
  def index
    @agendamento_de_visitas = AgendamentoDeVisita.all

SELECT "usuarios".* FROM "usuarios"
SELECT "imovels".* FROM "imovels"
---
  def new
    @agendamento_de_visita = AgendamentoDeVisita.new
    @usuarios = Usuario.all
    @imoveis = Imovel.all

SELECT "usuarios".* FROM "usuarios"
SELECT "imovels".* FROM "imovels"
---
  def edit
    @usuarios = Usuario.all
    @imoveis = Imovel.all

INSERT INTO "agendamento_de_visitas" ("created_at", "data", "hora", "imovel_id", "updated_at", "usuario_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2014-10-26 22:26:23.662413"], ["data", "2014-10-30"], ["hora", "12:40"], ["imovel_id", 2], ["updated_at", "2014-10-26 22:26:23.662413"], ["usuario_id", 2]]
---
  def create
    @agendamento_de_visita = AgendamentoDeVisita.new(agendamento_de_visita_params)

    respond_to do |format|
      if @agendamento_de_visita.save

UPDATE "agendamento_de_visitas" SET "hora" = ?, "updated_at" = ? WHERE "agendamento_de_visitas"."id" = 3  [["hora", "11:40"], ["updated_at", "2014-10-26 22:26:30.086202"]]
---
  def update
    respond_to do |format|
      if @agendamento_de_visita.update(agendamento_de_visita_params)

DELETE FROM "agendamento_de_visitas" WHERE "agendamento_de_visitas"."id" = ?  [["id", 1]]
---
  def destroy
    @agendamento_de_visita.destroy

SELECT  "agendamento_de_visitas".* FROM "agendamento_de_visitas"  WHERE "agendamento_de_visitas"."id" = ? LIMIT 1  [["id", 3]]
---
    def set_agendamento_de_visita
      @agendamento_de_visita = AgendamentoDeVisita.find(params[:id])