app/controllers/imovels_controller.rb

  def index
    @imovels = Imovel.all
---
SELECT "imovels".* FROM "imovels"

  def new
    @imovel = Imovel.new
      @todosproprietarios = Proprietario.all
      @todosimoveis = TipoDeImovel.all
---
SELECT "proprietarios".* FROM "proprietarios"
SELECT "tipo_de_imovels".* FROM "tipo_de_imovels"

  def edit
    @todosproprietarios = Proprietario.all
    @todosimoveis = TipoDeImovel.all
---
SELECT "proprietarios".* FROM "proprietarios"
SELECT "tipo_de_imovels".* FROM "tipo_de_imovels"

  def create
    @imovel = Imovel.new(imovel_params)

    respond_to do |format|
      if @imovel.save
---
INSERT INTO "imovels" ("area", "areaDeServico", "areaExterna", "banheiro", "cozinha", "created_at", "endereco", "garagem", "proprietario_id", "quarto", "sala", "tipo_de_imovel_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @imovel.update(imovel_params)
---
UPDATE "imovels" SET "area" = ?, "areaDeServico" = ?, "areaExterna" = ?, "endereco" = ?, "updated_at" = ? WHERE "imovels"."id" = 1  [["area", 80.5], ["areaDeServico", 1.0], ["areaExterna", 30.5], ["endereco", "campos"], ["updated_at", "2014-10-24 21:52:22.917235"]]

  def destroy
    @imovel.destroy
---
DELETE FROM "imovels" WHERE "imovels"."id" = ?  [["id", 1]]

    def set_imovel
      @imovel = Imovel.find(params[:id])
---
SELECT  "imovels".* FROM "imovels"  WHERE "imovels"."id" = ? LIMIT 1  [["id", 1]]