app/controllers/proprietarios_controller.rb

SELECT "proprietarios".* FROM "proprietarios"
---
  def index
    @proprietarios = Proprietario.all

INSERT INTO "proprietarios" ("cpf", "created_at", "email", "endereco", "nome", "telefone", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @proprietario = Proprietario.new(proprietario_params)

    respond_to do |format|
      if @proprietario.save

UPDATE "proprietarios" SET "cpf" = ?, "email" = ?, "endereco" = ?, "nome" = ?, "telefone" = ?, "updated_at" = ? WHERE "proprietarios"."id" = 1  [["cpf", "123.456.899-00"], ["email", "ana@gmail.com"], ["endereco", "campos"], ["nome", "Ana"], ["telefone", "23234456"], ["updated_at", "2014-10-23 21:40:41.680551"]]
---
  def update
    respond_to do |format|
      if @proprietario.update(proprietario_params)

DELETE FROM "proprietarios" WHERE "proprietarios"."id" = ?  [["id", 1]]
---
  def destroy
    @proprietario.destroy

SELECT  "proprietarios".* FROM "proprietarios"  WHERE "proprietarios"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_proprietario
      @proprietario = Proprietario.find(params[:id])