app/controllers/proposta_controller.rb

  def new
    @propostum = Propostum.new
    @usuarios = Usuario.all
    @imoveis = Imovel.all
---
SELECT "usuarios".* FROM "usuarios"
SELECT "imovels".* FROM "imovels"

  def edit
    @usuarios = Usuario.all
    @imoveis = Imovel.all
---
SELECT "usuarios".* FROM "usuarios"
SELECT "imovels".* FROM "imovels"