app/controllers/tipo_de_imovels_controller.rb

SELECT "tipo_de_imovels".* FROM "tipo_de_imovels"
---
  def index
    @tipo_de_imovels = TipoDeImovel.all

INSERT INTO "tipo_de_imovels" ("created_at", "descricao", "tipoDeContrato", "updated_at", "valor") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-10-26 22:21:58.170067"], ["descricao", "Casa"], ["tipoDeContrato", "venda"], ["updated_at", "2014-10-26 22:21:58.170067"], ["valor", 200000.0]]
---
  def create
    @tipo_de_imovel = TipoDeImovel.new(tipo_de_imovel_params)

    respond_to do |format|
      if @tipo_de_imovel.save

UPDATE "tipo_de_imovels" SET "descricao" = ?, "tipoDeContrato" = ?, "updated_at" = ?, "valor" = ? WHERE "tipo_de_imovels"."id" = 1  [["descricao", "casa"], ["tipoDeContrato", "venda"], ["updated_at", "2014-10-23 20:01:54.038880"], ["valor", 200500.0]]
---
  def update
    respond_to do |format|
      if @tipo_de_imovel.update(tipo_de_imovel_params)

DELETE FROM "tipo_de_imovels" WHERE "tipo_de_imovels"."id" = ?  [["id", 1]]
---
  def destroy
    @tipo_de_imovel.destroy

SELECT  "tipo_de_imovels".* FROM "tipo_de_imovels"  WHERE "tipo_de_imovels"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_tipo_de_imovel
      @tipo_de_imovel = TipoDeImovel.find(params[:id])