app/controllers/usuarios_controller.rb

  def create
    @usuario = Usuario.new(usuario_params)

    respond_to do |format|
      if @usuario.save
---
INSERT INTO "usuarios" ("cpf", "created_at", "email", "endereco", "nome", "telefone", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @usuario.update(usuario_params)
---
UPDATE "usuarios" SET "cpf" = ?, "email" = ?, "endereco" = ?, "nome" = ?, "telefone" = ?, "updated_at" = ? WHERE "usuarios"."id" = 1  [["cpf", "123.456.899-00"], ["email", "ana@gmail.com"], ["endereco", "campos"], ["nome", "Ana"], ["telefone", "23234456"], ["updated_at", "2014-10-23 22:15:22.843001"]]

  def destroy
    @usuario.destroy
---
DELETE FROM "usuarios" WHERE "usuarios"."id" = ?  [["id", 1]]

    def set_usuario
      @usuario = Usuario.find(params[:id])
---
SELECT  "usuarios".* FROM "usuarios"  WHERE "usuarios"."id" = ? LIMIT 1  [["id", 1]]